Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: The financial results for 2002 are better ~ than for 2000. The income increased by 50%, ~ even though 2001 had more rain than 2000. ~ 2000 2001 ~ income 45,403 66,234 ~
es_es: Los resultados financieros de 2002 son mejores ~ que para el año 2000. Los ingresos aumentaron un ~ 50%, ~ 2001, más aun cuando había más lluvia que en el 2000. ~ 2000 2001~ ingresos 45.403 66.234 ~

source: Adding more than one can be done by prepending the number to CTRL-A. Suppose you have this list:
es_es: Es posible añadir más de uno si prefija un número a CTRL-A. Suponga que tiene esta lista:

source: 1. item four ~ 2. item five ~ 3. item six ~
es_es: 1. cuarto elemento ~ 2. quinto elemento ~ 3. sexto elemento ~

source: The "1." will change to "4.". Again, you can use "." to repeat this on the other numbers.
es_es: El «1.» pasará a ser «4.». Otra vez, puede usar «.» para repetir la misma acción sobre otros números.

source: 7 plus one is 10? What happened here is that Vim recognized "007" as an octal number, because there is a leading zero. This notation is often used in C programs. If you do not want a number with leading zeros to be handled as octal, use this: >
es_es: ¿7 más 1 igual a 10? Lo que ha ocurrido es que Vim reconoció 007 como un número octal, ya que hay un cero precediendo el número. Esta notación se usa a menudo en programas C. Si no desea que un número con ceros a la izquierda se considere un número octal, use lo siguiente: >

source: *26.3* Making a change in many files
es_es: *26.3* Realizar un cambio en varios archivos

source: :args *.c < This finds all C files and edits the first one. Now you can perform a substitution command on all these files: >
es_es: :args *.c < Esto encuentra todos los archivos C y edita el primero. Ahora puede realizar una orden de sustitución sobre todos estos archivos: >

source: The ":argdo" command takes an argument that is another command. That command will be executed on all files in the argument list. The "%s" substitute command that follows works on all lines. It finds the word "x_cnt" with "\<x_cnt\>". The "\<" and "\>" are used to match the whole word only, and not "px_cnt" or "x_cnt2". The flags for the substitute command include "g" to replace all occurrences of "x_cnt" in the same line. The "e" flag is used to avoid an error message when "x_cnt" does not appear in the file. Otherwise ":argdo" would abort on the first file where "x_cnt" was not found. The "|" separates two commands. The following "update" command writes the file only if it was changed. If no "x_cnt" was changed to "x_counter" nothing happens.
es_es: La orden «:argdo» toma otra orden como argumento. Esta orden se ejecutará sobre todos los archivos en la lista de argumentos. La orden de sustitución «%s» a continuación afecta a todas las líneas. Busca la palabra «x_cnt» con «\<x_cnt\>». Los «\<» y «\>» se usan para encontrar sólo la palabra completa, y no «px_cnt» o «x_cnt2». Las opciones para la orden de sustitución incluyen «g» para reemplazar todas las apariciones de «x_cnt» en la misma línea. La opción «e» se emplea para evitar un mensaje de error cuando «x_cnt» no está presente en el archivo. En caso contrar, «:argdo» se interrumpiría en el primer archivo en el que no se encontrase «x_cnt». La «|» separa dos órdenes. La orden a continuación «update» escribe en el archivo sólo si éste cambió. Si no se cambió ningún «x_cnt» a «x_counter» no ocurrirá nada.

source: There is also the ":windo" command, which executes its argument in all windows. And ":bufdo" executes its argument on all buffers. Be careful with this, because you might have more files in the buffer list than you think. Check this with the ":buffers" command (or ":ls").
es_es: También dispone de la orden «:windo», que ejecuta su argumento en todas las ventanas. «:bufdo» ejecuta su argumento en todos los búfers. Sea cuidadoso con esto, porque puede que tenga más archivos de los que crea en su lista de búfers. Revise esto con la orden «:buffers» (o «:ls»).

source: *26.4* Using Vim from a shell script
es_es: *26.4* Usar Vim desde un script de intérprete de órdenes

source: Suppose you have a lot of files in which you need to change the string "-person-" to "Jones" and then print it. How do you do that? One way is to do a lot of typing. The other is to write a shell script to do the work. The Vim editor does a superb job as a screen-oriented editor when using Normal mode commands. For batch processing, however, Normal mode commands do not result in clear, commented command files; so here you will use Ex mode instead. This mode gives you a nice command-line interface that makes it easy to put into a batch file. ("Ex command" is just another name for a command-line (:) command.) The Ex mode commands you need are as follows: >
es_es: Suponga que tiene que cambiar la cadena «-persona-» a «Juan» en varios archivos, e imprimirlo después. ¿Como se hace? Una manera es teclear mucho. La otra es escribir un script de consola para hacer la tarea. El editor Vim realiza un trabajo superlativo como un editor orientado a pantalla cuando usa las órdenes de modo Normal. Para un procesamiento en lotes, por otra parte, las órdenes de modo Normal no finalizan correctamente como archivos claros y comentados; para ello tiene que usar el modo Ex. Este modo ofrece una bonita interfaz de línea de órdenes que facilita su inserción en un archivo de lotes. («Orden Ex» es sólo otro nombre para una orden en la línea de órdenes («:»).) Las órdenes del modo Ex que necesita son las siguientes: >

source: %s/-person-/Jones/g write tempfile quit
es_es: %s/-persona-/Juan/g write archivo_temporal quit

source: You put these commands in the file "change.vim". Now to run the editor in batch mode, use this shell script: >
es_es: Ponga estas órdenes en el archivo «change.vim». Para ejecutar el editor en modo de lotes, ese este script de consola: >

source: for file in *.txt; do vim -e -s $file < change.vim lpr -r tempfile done
es_es: for file in *.txt; do vim -e -s $file < change.vim lpr -r archivo_temporal done

source: The for-done loop is a shell construct to repeat the two lines in between, while the $file variable is set to a different file name each time. The second line runs the Vim editor in Ex mode (-e argument) on the file $file and reads commands from the file "change.vim". The -s argument tells Vim to operate in silent mode. In other words, do not keep outputting the :prompt, or any other prompt for that matter. The "lpr -r tempfile" command prints the resulting "tempfile" and deletes it (that's what the -r argument does).
es_es: El bucle for-done es una construcción de consola para repetir las dos líneas entre ellas, mientras que la variable $file es definida con un nombre diferente cada vez. La segunda línea inicia Vim en modo Ex (argumento «-e») en el archivo $file y lee las órdenes del archivo «change.vim». El argumento «-s» le dice a Vim que opere en modo silencioso. En otras palabras, no mostrar «:prompt» (cuadro de diálogo interactivo), o cualquier otro diálogo. La orden «lpr -r archivo_temporal» muestra el «archivo_temporal» resultante y lo elimina (esto es lo que hace el argumento «-r»).

source: Vim can read text on standard input. Since the normal way is to read commands there, you must tell Vim to read text instead. This is done by passing the "-" argument in place of a file. Example: >
es_es: Vim puede leer texto desde la entrada estándar. Debido a que esta es la manera normal de leer órdenes, tendrá que decirle a Vim que lea texto. Esto se hace introduciendo el argumento «-» en lugar de un archivo. Ejemplo: >

source: This allows you to edit the output of the "ls" command, without first saving the text in a file. If you use the standard input to read text from, you can use the "-S" argument to read a script: >
es_es: Esto permite editar la salida de la orden «ls», sin guardar primero el texto en un archivo. Si usa la entrada estándar para leer texto, puede usar el argumento «-S» para leer un script: >

source: vim -s script file.txt ... < Note: "-s" has a different meaning when it is used without "-e". Here it means to source the "script" as Normal mode commands. When used with "-e" it means to be silent, and doesn't use the next argument as a file name.
es_es: vim -s script file.txt ... < Nota: «-s» tiene un significado diferente cuando se usa sin «-e». Aquí significa que tiene que cargar el script como si fueran órdenes de modo Normal. «-e» significa modo silencioso, y no usa el siguiente argumento como un nombre de archivo.

source: The commands in "script" are executed like you typed them. Don't forget that a line break is interpreted as pressing <Enter>. In Normal mode that moves the cursor to the next line. To create the script you can edit the script file and type the commands. You need to imagine what the result would be, which can be a bit difficult. Another way is to record the commands while you perform them manually. This is how you do that: >
es_es: Las órdenes en «script» se ejecutan como los introdujo. No olvide que un salto de línea se interpreta como <Intro>. En modo Normal, desplaza el cursor a la siguiente línea. Para crear el script, puede editar el archivo de script y teclear las órdenes. Necesita imaginar el resultado final, lo cual es un poco difícil. Otra manera es grabar las órdenes al ejecutarlas manualmente. Así es como se hace: >

source: *usr_01.txt* For Vim version 7.3. Last change: 2008 May 07
es_es: *usr_01.esx* Para Vim versión 7.3. Último cambio: 7/6/2008

source: About the manuals
es_es: Acerca de los manuales

source: This chapter introduces the manuals available with Vim. Read this to know the conditions under which the commands are explained.
es_es: Este capítulo le introduce a los manuales disponibles con Vim. Lea esto para conocer las condiciones bajo las cuales se explican las órdenes.

source: |01.1| Two manuals |01.2| Vim installed |01.3| Using the Vim tutor |01.4| Copyright
es_es: |01.1| Dos manuales |01.2| Vim instalado |01.3| Usar el tutor de Vim |01.4| Copyright

source: Next chapter: |usr_02.txt| The first steps in Vim Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_02.esx| Primeros pasos en Vim Tabla de contenidos: |usr_toc.esx|

source: *01.1* Two manuals
es_es: *01.1* Dos manuales

source: 1. The User manual Task oriented explanations, from simple to complex. Reads from start to end like a book.
es_es: 1. El manual de usuario Explicaciones orientadas a tareas, de las simples a las más complejas. Se puede leer de principio a fin, como un libro.

source: 2. The Reference manual Precise description of how everything in Vim works.
es_es: 2. El manual de referencia Una precisa descripción del funcionamiento de cada elemento dentro de Vim.

source: The text contains hyperlinks between the two parts, allowing you to quickly jump between the description of an editing task and a precise explanation of the commands and options used for it. Use these two commands:
es_es: El texto contiene hiperenlaces entre las dos partes, lo cual le permite saltar rápidamente de la descripción de una tarea de edición a una precisa explicación de las órdenes y opciones que se emplean. Use estas dos órdenes:

source: Press CTRL-] to jump to a subject under the cursor. Press CTRL-O to jump back (repeat to go further back).
es_es: Pulse «CTRL-]» para saltar al tema bajo el cursor. Pulse «CTRL-O» para saltar atrás (repita para volver más allá de ese punto).

source: Many links are in vertical bars, like this: |bars|. An option name, like 'number', a command in double quotes like ":write" and any other word can also be used as a link. Try it out: Move the cursor to CTRL-] and press CTRL-] on it.
es_es: Hay varios enlaces entre barras verticales, como este: |bars|. También puede usar como enlace un nombre de opción, como 'number', una orden entrecomillada, como «:write», o cualquier otra palabra. Pruebelo: mueva el cursor a «CTRL-]» y pulse «CTRL-]» sobre él.

source: *01.2* Vim installed
es_es: *01.2* Vim instalado

source: If you start Vim now, the 'compatible' option should be off. You can check it with this command: >
es_es: Si inicia ahora Vim, la opción 'compatible' debería estar desactivada. Puede asegurarse con esta orden: >

source: If it responds with "nocompatible" you are doing well. If the response is "compatible" you are in trouble. You will have to find out why the option is still set. Perhaps the file you wrote above is not found. Use this command to find out: >
es_es: Si devuelve "nocompatible", es que todo va bien. Si la respuesta es «compatible», tiene un problema. Tendrá que encontrar porqué esta opción está aún definida. Puede que no se encontrase el archivo que copió antes. Use esta orden para ver el problema: >

source: If your file is not in the list, check its location and name. If it is in the list, there must be some other place where the 'compatible' option is switched back on.
es_es: Si su archivo no se encuentra en la lista, revise su nombre y ubicación. Si está en la lista, debe haber algún otro sitio en el que se reactiva la opción 'compatible'.

source: Note: This manual is about using Vim in the normal way. There is an alternative called "evim" (easy Vim). This is still Vim, but used in a way that resembles a click-and-type editor like Notepad. It always stays in Insert mode, thus it feels very different. It is not explained in the user manual, since it should be mostly self explanatory. See |evim-keys| for details.
es_es: Nota: Este manual trata acerca del uso de Vim de la manera normal. Existe una alternativa llamada «evim» (easy Vim). Sigue siendo Vim, pero se usa de una manera parecida a un editor como Notepad. Permanece siempre en el modo Insertar, y por ello parece muy distinto. No se explica en el manual de usuario, ya que es bastante sencillo. Véase |evim-keys| para más detalles.

source: *01.3* Using the Vim tutor *tutor* *vimtutor*
es_es: *01.3* Usar el tutor de Vim *tutor* *vimtutor*

source: Instead of reading the text (boring!) you can use the vimtutor to learn your first Vim commands. This is a 30 minute tutorial that teaches the most basic Vim functionality hands-on.
es_es: En lugar de leer el texto (¡aburre!), puede usar vimtutor para aprender sus primeras órdenes con Vim. Éste es un tutorial de treinta minutos que enseña las funcionalidades básicas de Vim a través de la práctica.

source: On Unix, if Vim has been properly installed, you can start it from the shell: > vimtutor
es_es: En Unix, si Vim se instaló adecuadamente, puede iniciar Vim desde la consola: > vimtutor

source: On MS-Windows you can find it in the Program/Vim menu. Or execute vimtutor.bat in the $VIMRUNTIME directory.
es_es: En MS-Windows, lo encontrará en el menú Programas/Vim. O puede ejecutar «vimtutor.bat» en el directorio $VIMRUNTIME.

source: This will make a copy of the tutor file, so that you can edit it without the risk of damaging the original. There are a few translated versions of the tutor. To find out if yours is available, use the two-letter language code. For French: >
es_es: Esto crea una copia del archivo del tutor, para que así pueda editarlo sin peligro de dañar el original. Existen unas cuantas versiones traducidas del tutor. Para ver si el suyo está disponible, use el código de idioma de dos letras. Para el francés: >

source: 1. Copy the tutor file. You can do this with Vim (it knows where to find it): > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor' -c 'w! TUTORCOPY' -c 'q' < This will write the file "TUTORCOPY" in the current directory. To use a translated version of the tutor, append the two-letter language code to the filename. For French: > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor.fr' -c 'w! TUTORCOPY' -c 'q' < 2. Edit the copied file with Vim: > vim -u NONE -c "set nocp" TUTORCOPY < The extra arguments make sure Vim is started in a good mood.
es_es: 1. Copie el archivo del tutor. Puede hacer esto con Vim (sabe donde encontrarlo): > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor' -c 'w! TUTORCOPY' -c 'q' < Esto copia el archivo «TUTORCOPY» al directorio actual. Para usar una versión traducida del tutor, afije el código de idioma al nombre del archivo. Para francés: > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor.fr' -c 'w! TUTORCOPY' -c 'q' < 2. Edite la copia del archivo con Vim: > vim -u NONE -c "set nocp" TUTORCOPY < Los argumentos extra se aseguran de que Vim se inicie adecuadamente:

source: 3. Delete the copied file when you are finished with it: > del TUTORCOPY < ==============================================================================
es_es: 3. Borrar el archivo copiado cuando haya acabado con él: > del TUTORCOPY ==============================================================================

source: The Vim user manual and reference manual are Copyright (c) 1988-2003 by Bram Moolenaar. This material may be distributed only subject to the terms and conditions set forth in the Open Publication License, v1.0 or later. The latest version is presently available at: http://www.opencontent.org/openpub/
es_es: El manual de usuario y el manual de referencia están bajo el Copyright (c) 1988-2003 por Bram Moolenaar. Este material se distribuirá sólo bajo estos términos de licencia y condiciones expuestas en la Open Publication License, versión 1.0 o posterior. La versión más actual está ahora disponible en: http://www.opencontent.org/openpub/

source: People who contribute to the manuals must agree with the above copyright notice. *frombook* Parts of the user manual come from the book "Vi IMproved - Vim" by Steve Oualline (published by New Riders Publishing, ISBN: 0735710015). The Open Publication License applies to this book. Only selected parts are included and these have been modified (e.g., by removing the pictures, updating the text for Vim 6.0 and later, fixing mistakes). The omission of the |frombook| tag does not mean that the text does not come from the book.
es_es: Las personas que contribuyan al manual también tienen que aceptar el copyright expuesto anteriormente. *frombook* Hay partes del manual de usuario que proceden del libro «Vi IMproved - Vim», por Steve Oualline (publicado por New Riders Publishing, ISBN: 0735710015). La Open Publication License también cubre a este libro. Sólo se incluyen partes seleccionadas, y estas se han modificado (p. ej. se eliminaron las fotos, se actualizó el texto para Vim 6.0 y posteriores, corrección de errata). La omisión de la etiqueta |frombook| no significa que el texto no proceda del libro.

source: Many thanks to Steve Oualline and New Riders for creating this book and publishing it under the OPL! It has been a great help while writing the user manual. Not only by providing literal text, but also by setting the tone and style.
es_es: ¡Muchas gracias a Steve Oualline y a New Riders por crear este libro, y publicarlo bajo la licencia OPL! Ha servido de gran ayuda a la hora de escribir este manual. No sólo por el texto literal, sino también al definir el tono y estilo.

source: If you make money through selling the manuals, you are strongly encouraged to donate part of the profit to help AIDS victims in Uganda. See |iccf|.
es_es: Si obtiene beneficios mediante la venta de los manuales, le animamos a que done parte de los beneficios para ayudar a las victimas del SIDA en Uganda. Véase |iccf|.

source: *usr_07.txt* For Vim version 7.3. Last change: 2006 Apr 24
es_es: *usr_07.esx* Para Vim version 7.3. Último cambio: 24/5/2006

source: Editing more than one file
es_es: Editar más de un archivo

source: No matter how many files you have, you can edit them without leaving Vim. Define a list of files to work on and jump from one to the other. Copy text from one file and put it in another one.
es_es: No importa cuántos archivos tenga, puede editarlos todos sin salir de Vim. Defina una lista de archivos de trabajo y pase de uno a otro. Copie texto de un archivo a otro.

source: |07.1| Edit another file |07.2| A list of files |07.3| Jumping from file to file |07.4| Backup files |07.5| Copy text between files |07.6| Viewing a file |07.7| Changing the file name
es_es: |07.1| Editar otro archivo |07.2| Una lista de archivos |07.3| Pasar de archivo a archivo |07.4| Copias de seguridad |07.5| Copiar texto entre archivos |07.6| Ver un archivo |07.7| Cambiar el nombre de archivo

source: Next chapter: |usr_08.txt| Splitting windows Previous chapter: |usr_06.txt| Using syntax highlighting Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_08.esx| Dividir en ventanas Capítulo anterior: |usr_06.esx| Uso del coloreado de sintaxis Tabla de contenidos: |usr_toc.esx|

source: *07.1* Edit another file
es_es: *07.1* Editar otro archivo

source: You can use any file name instead of "foo.txt". Vim will close the current file and open the new one. If the current file has unsaved changes, however, Vim displays an error message and does not open the new file:
es_es: Puede usar cualquier nombre de archivo en lugar de «foo.txt». Vim cerrará el archivo actual y abrirá uno nuevo. Sin embargo, si el archivo actual tiene cambios no guardados, Vim mostrará un error y no abrirá el archivo nuevo:

source: Note: Vim puts an error ID at the start of each error message. If you do not understand the message or what caused it, look in the help system for this ID. In this case: >
es_es: Nota: Vim coloca una ID de error al comienzo de cada mensaje de error. Si no entiende el mensaje o su causa, puedes buscar ayuda para esta ID. En este caso: >

source: At this point, you have a number of alternatives. You can write the file using this command: >
es_es: En este punto, dispone de una serie de alternativas. Puede escribir el archivo usando esta orden: >

source: The text with changes is still there, but you can't see it. This is further explained in section |22.4|: The buffer list.
es_es: El texto con los cambios está todavía aquí, pero no lo puede ver. Esto se explica con más detalle en la sección |22.4|: La lista de búfers.

source: *07.2* A list of files
es_es: *07.2* Una lista de archivos

source: You can start Vim to edit a sequence of files. For example: >
es_es: Puede iniciar Vim para editar una secuencia de archivos. Por ejemplo: >

source: vim one.c two.c three.c
es_es: vim uno.c dos.c tres.c

source: This command starts Vim and tells it that you will be editing three files. Vim displays just the first file. After you have done your thing in this file, to edit the next file you use this command: >
es_es: Esta orden inicia Vim y le dice que va a editar tres archivos. Vim muestra solamente el primero. Tras haber terminado con el primero, puede editar el siguiente con esta orden: >

source: If you have unsaved changes in the current file, you will get an error message and the ":next" will not work. This is the same problem as with ":edit" mentioned in the previous section. To abandon the changes: >
es_es: Si tiene cambios sin guardar en el archivo actual, obtendrá un mensaje de error y «:next» no funcionará. Este es el mismo problema mencionado con «:edit» en la sección anterior. Para abandonar los cambios: >

source: But mostly you want to save the changes and move on to the next file. There is a special command for this: >
es_es: Pero habitualmente querrá guardar los cambios e ir al siguiente archivo. Hay una orden especial para esto: >

source: To see which file in the argument list you are editing, look in the window title. It should show something like "(2 of 3)". This means you are editing the second file out of three files. If you want to see the list of files, use this command: >
es_es: Para ver qué archivo de la lista de argumentos está editando, mire en el título de la ventana. Debería mostrar algo como «(2 de 3)». Esto significa que está editando un segundo archivo de una lista de tres. Si quieres ver la lista de archivos, use esta orden: >
